app/controllers/events_controller.rb

SELECT "events".* FROM "events"
SELECT  1 AS one FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = $1 AND "users"."id" = $2 LIMIT 1  [["event_id", 1], ["id", 2]]
---
 def data
   events = Event.where(start_date:params['from'].to_datetime.beginning_of_day..params['to'].to_datetime.beginning_of_day)
   map =current_user.events_to_hash


  #     ue.start_date.to_s: ue.event_type,
  # }

   event_json = events.map {|event| {
              :id => event.id,
              :start_date => event.start_date.strftime("%Y-%m-%d %H:%M:%S"),
              :end_date => event.end_date.strftime("%Y-%m-%d %H:%M:%S"),
              :text => event.text,
              :rec_type => event.rec_type,
              :event_type => event.event_type,
              :max_users => event.max_users,
              :event_length => event.event_length,
              :event_pid => event.event_pid,
              :users => event.users.size,
              :reserved => event.reserved_for?(current_user),
              :reserved_for_today => map[event.start_date.strftime("%Y-%m-%d")] == event.event_type,
              :full => event.full?,
              :past => event.past?,
              :instructor_name => event.instructor_name.present? ? event.instructor_name : "",
              :color => event_color(event),
              :reserved_by => current_user.admin? ? event.users.map{|user| "#{user.name.to_s} (#{user.email})"} : [],
              :allowed => current_user.admin? || current_user.subscribed_event_types.try(:include?, event.event_type)

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
---
 def reserve_event
  recurring_event = params['recurring_event']
  origin_event = Event.find(params['id'])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
---
 def cancel_event
  event = Event.find(params['id'])

INSERT INTO "events" ("start_date", "end_date", "text", "rec_type", "max_users", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
 def db_action
   mode = params['!nativeeditor_status']
   id = params['id']
   start_date = params['start_date']
   end_date = params['end_date']

   text = params['text']
   rec_type = params['rec_type'] == nil ? "" : params['rec_type']
   max_users = params['max_users']
   event_type = params['event_type']
   event_length = params['event_length']
   instructor_name = params['instructor_name']
   event_pid = params['event_pid']
   tid = id

   case mode
     when 'inserted'
       event = Event.create :start_date => start_date, :end_date => end_date, :text => text, :instructor_name => instructor_name,
                            :rec_type => rec_type, :max_users => max_users, :event_type => event_type, :event_length => event_length, :event_pid => event_pid

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "events" SET "start_date" = $1, "end_date" = $2, "event_length" = $3, "event_pid" = $4, "updated_at" = $5 WHERE "events"."id" = $6  [["start_date", "2016-06-20 18:00:00.000000"], ["end_date", "2016-06-20 22:20:00.000000"], ["event_length", 0], ["event_pid", 0], ["updated_at", "2016-06-20 01:58:51.289529"], ["id", 2]]
---

       if event_pid != 0 and event_pid != ''
          p "2"*100
         event = Event.find(id)
         event.rec_type = 'none'
         event.save