app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."approved" = $1 LIMIT 1  [["approved", "f"]]
SELECT "users".* FROM "users"
---
  def index
    if params[:approved] == "false"
      @users = User.where(approved:false)
    else
      @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
UPDATE "users" SET "approved" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["approved", "t"], ["updated_at", "2016-06-20 08:51:06.410270"], ["id", 3]]
---
  def approve
    @user = User.find(params[:id])
     if @user.update_attributes(approved: true)